tap "nikitabobko/tap"
tap "pwndbg/tap"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Programmable completion for Bash 3.2
brew "bash-completion"
# Cryptography and SSL/TLS Toolkit
brew "openssl@3"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Parser generator
brew "bison"
# Ruby environment tool
brew "chruby"
# Cross-platform make
brew "cmake"
# Console Matrix
brew "cmatrix"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# Pack, ship and run any application as a lightweight container
brew "docker"
# Modern, maintained replacement for ls
brew "eza"
# Simple, fast and user-friendly alternative to find
brew "fd"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# Banner-like program prints strings as ASCII art
brew "figlet"
# Command-line fuzzy finder written in Go
brew "fzf"
# General-purpose data compression with high compression ratio
brew "xz"
# GNU compiler collection
brew "gcc"
# GNU database manager
brew "gdbm"
# OpenType text shaping engine
brew "harfbuzz"
# Framework for layout and rendering of i18n text
brew "pango"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Distributed revision control system
brew "git"
# GNU Transport Layer Security (TLS) Library
brew "gnutls"
# Terminal based graphical activity monitor inspired by gtop and vtop
brew "gotop"
# General-purpose preprocessor with customizable syntax
brew "gpp"
# Configurable static site generator
brew "hugo"
# Enhanced version of john, a UNIX password cracker
brew "john-jumbo"
# New file format for still image compression
brew "jpeg-xl"
# Lightweight and flexible command-line JSON processor
brew "jq"
# Handy way to save and run project-specific commands
brew "just"
# Subtitle renderer for the ASS/SSA subtitle format
brew "libass"
# Portable Foreign Function Interface library
brew "libffi"
# YAML Parser
brew "libyaml"
# Powerful, lightweight programming language
brew "lua"
# Fast, highly customisable system info script
brew "neofetch"
# Incremental parsing library
brew "tree-sitter"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Port scanning utility for large networks
brew "nmap"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Optimized BLAS library
brew "openblas"
# Package for scientific computing with Python
brew "numpy"
# High performance message passing library
brew "open-mpi"
# Development kit for the Java programming language
brew "openjdk"
# Multithreaded PNG optimizer written in Rust
brew "oxipng"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# PNG image optimizing utility
brew "pngquant"
# Pretty, minimal and fast ZSH prompt
brew "pure"
# CTF framework used by Gallopsled in every CTF
brew "pwntools"
# Python 3 bindings for the Cairo graphics library
brew "py3cairo"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Install various Ruby versions and implementations
brew "ruby-build"
# Ruby version manager
brew "rbenv"
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Install Ruby, JRuby, Rubinius, TruffleRuby, or mruby
brew "ruby-install"
# Software for mathematics, science, and engineering
brew "scipy"
# Static analysis and lint tool, for (ba)sh scripts
brew "shellcheck"
# Programmatically correct mistyped console commands
brew "thefuck"
# Terminal multiplexer
brew "tmux"
# Color-based alternative to figlet (uses libcaca)
brew "toilet"
# Plugin manager for tmux
brew "tpm"
# CLI tool that moves files or folder to the trash
brew "trash", link: true
# Internet file retriever
brew "wget"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Distribution of the Python and R programming languages for scientific computing
cask "anaconda"
# Application uninstaller
cask "appcleaner"
# Web browser
cask "firefox"
# Web browser
cask "google-chrome"
# Keyboard shortcuts for every button on your screen
cask "homerow"
# Open-source keystroke visualiser
cask "keycastr"
# Full TeX Live distribution with GUI applications
cask "mactex"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# Exploit Development and Reverse Engineering with GDB Made Easy
cask "pwndbg/tap/pwndbg-gdb"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# Emoji picker optimised for blind people
cask "rocket"
